{"h9mylm9": {"parent_id": "p7xluj", "awards": 2, "points": 15864, "body": "Anything I’ll use for years. \n\nLike computer or clothes.", "deleted": false}, "h9n09ko": {"parent_id": "p7xluj", "awards": 2, "points": 10159, "body": "A really good quality winter coat or jacket.  To me, it's definitely worth the investment if you live in a country that gets cold winters.  Here in Ireland it doesn't snow much in winter due to us being a small island, but we get very cold winters and very wet ones, so you get really cold rain.\n\n&#x200B;\n\nPaying extra for a really good quality, warm and waterproof coat makes SUCH a difference if you're out and about a lot like I am.  It pays for itself because it can last you years.\n\n&#x200B;\n\nI'm due a new one this year, got five years out of my last one and it's still good, but I've lost a significant amount of weight this past year and it's much too big for me now.", "deleted": false}, "h9n0uyz": {"parent_id": "p7xluj", "awards": 0, "points": 5418, "body": "Winter tires or tires in general", "deleted": false}, "h9n2nax": {"parent_id": "p7xluj", "awards": 1, "points": 19165, "body": "Motorcycle helmets.\n\nYou don’t need the most expensive helmet, but you should pay what it takes to get something with a decent certification (ECE, FIM) and not just DOT.", "deleted": false}, "h9my5ub": {"parent_id": "p7xluj", "awards": 5, "points": 19502, "body": "Work boots", "deleted": false}, "h9n0ggx": {"parent_id": "p7xluj", "awards": 0, "points": 25410, "body": "A good plumber, water damage fucking sucks", "deleted": false}, "h9nfjnh": {"parent_id": "p7xluj", "awards": 1, "points": 3918, "body": "Movers. Having them put your furniture in a truck, drive it to your location and put it in your new place. It’s great not having a sore back when it’s stressful enough to move.", "deleted": false}, "h9n2qe8": {"parent_id": "p7xluj", "awards": 0, "points": 24008, "body": "Currently sitting in the airport for an egregiously complicated over-night layover, all to save $80. I'll always pay the extra $80 moving forward.", "deleted": false}, "h9nftjp": {"parent_id": "p7xluj", "awards": 2, "points": 7636, "body": "Direct flights instead of cheaper ones with layovers, 'connections,' or 'stops.'", "deleted": false}, "h9n7c9s": {"parent_id": "p7xluj", "awards": 1, "points": 8375, "body": "I live in Mexico. The national cinema chain (Cinépolis) often has two whole movie houses in each location. One is your standard, run-of-the-mill movie theater with 30 rows of stadium seating, while the other theater is “CinépolisVIP” which features reclining leather seats, USB charging ports, heated seats, around 30 seats total, and table service (food and alcohol). Reminds me of Alamo Drafthouse Cinemas in the USA, but these are nicer in my opinion. \n\nHusband and I always pay the extra pesos for the VIP theater for comfort, plus there are rarely issues with other patrons who also pay for the VIP theater - quiet people who really want to see the movie and won’t be chatting or constantly getting out of their seats through the entire movie. \n\nThe price difference between the two theaters really isn’t that much so it’s a small thing we always pay for.", "deleted": false}, "h9n2spi": {"parent_id": "p7xluj", "awards": 0, "points": 4075, "body": "Good pots and pans. Like real heavy duty stuff. \n\nI’ve got some pretty decent stainless steel,  but by far my favorites are always my le creuset stuff, I only have 4 pieces and I always found them on sale. \n\nI just make jambalaya in my Dutch oven last night. She was tasty.", "deleted": false}, "h9n8ypc": {"parent_id": "p7xluj", "awards": 0, "points": 4372, "body": "Headphones. Never going back to anything cheap.", "deleted": false}, "h9n24uo": {"parent_id": "p7xluj", "awards": 1, "points": 3737, "body": "Tattoos from an artist that knows what they're doing.", "deleted": false}, "h9n015b": {"parent_id": "p7xluj", "awards": 1, "points": 8931, "body": "Toilet paper.  Nothing worse than cheap toilet paper.", "deleted": false}, "h9n301h": {"parent_id": "p7xluj", "awards": 0, "points": 3743, "body": "As a lady with rather generously sized boobs I'm accustomed, and happy, to pay through the nose for a really good bra.  The difference it can make to my day is worth every penny.\n\n/r/ABraThatFits and /r/bigboobproblems for any others out there.", "deleted": false}, "h9n4lr1": {"parent_id": "p7xnwt", "awards": 0, "points": 9364, "body": "Not looking forward to cleaning this up!", "deleted": false}, "h9mza54": {"parent_id": "p7xnwt", "awards": 0, "points": 5292, "body": "That looks raw but im still going to eat it", "deleted": false}, "h9mz76j": {"parent_id": "p7xnwt", "awards": 0, "points": 4304, "body": "Look at that bone pull right out", "deleted": false}, "h9n3g7c": {"parent_id": "p7xnwt", "awards": 2, "points": 6327, "body": "Whos up for round 2?", "deleted": false}, "h9n1cyg": {"parent_id": "p7xnwt", "awards": 1, "points": 3343, "body": "Im pretty full, but could probably squeeze another sausage in", "deleted": false}, "h9n52bk": {"parent_id": "p7xnwt", "awards": 1, "points": 8708, "body": "It's still pink on the inside.", "deleted": false}, "h9n6wbk": {"parent_id": "p7xnwt", "awards": 0, "points": 5066, "body": "Keep it in there a little longer", "deleted": false}, "h9myje4": {"parent_id": "p7xnwt", "awards": 1, "points": 4896, "body": "You handle that meat well", "deleted": false}, "h9myzb0": {"parent_id": "p7xnwt", "awards": 10, "points": 14243, "body": "God it’s so juicy....wait, is that blood?", "deleted": false}, "h9myi7y": {"parent_id": "p7xnwt", "awards": 0, "points": 3579, "body": "Damn, thats hot.", "deleted": false}, "h9myqa9": {"parent_id": "p7xnwt", "awards": 5, "points": 7593, "body": "My mom is going to join us if you don't mind.", "deleted": false}, "h9mze2g": {"parent_id": "p7xnwt", "awards": 1, "points": 3009, "body": "My uncle taught me how to do that\n\n\nEdit: thanks for the awards and upvotes everyone!! My uncle would be proud, i'll be sure to tell him when he gets out of jail, in 1 to 5 years!", "deleted": false}, "h9n254r": {"parent_id": "p7y1gl", "awards": 0, "points": 3322, "body": "Social awkwardness and poor self esteem", "deleted": false}, "h9n6b2j": {"parent_id": "p7u0n9", "awards": 0, "points": 7514, "body": "Man, askreddit thirsty tonight.", "deleted": false}, "h9mjz0e": {"parent_id": "p7u0n9", "awards": 0, "points": 15295, "body": "I think the only thing we can all agree with is that there will be someone who will disagree no matter which celebrity you name.", "deleted": false}, "h9n42za": {"parent_id": "p7u0n9", "awards": 2, "points": 12435, "body": "Gaston. Nobody is like him", "deleted": false}, "h9n8jhy": {"parent_id": "p7u0n9", "awards": 29, "points": 49275, "body": "My grandma said I'm a handsome young man and I will become a famous celebrity one day so me", "deleted": false}, "h9n9nd2": {"parent_id": "p7u0n9", "awards": 3, "points": 9114, "body": "Viggo Mortensen as Aragorn\n\n\n\nEdit: Thanks for the awards guys!", "deleted": false}, "h9mafkp": {"parent_id": "p7u0n9", "awards": 2, "points": 6966, "body": "Young Marlon Brando", "deleted": false}, "h9n2aoq": {"parent_id": "p7u0n9", "awards": 0, "points": 3781, "body": "Audrey Hepburn", "deleted": false}, "h9mng66": {"parent_id": "p7u0n9", "awards": 2, "points": 3850, "body": "John Hamm is an objectively handsome man. Plus he’s packin’ that huge hog.", "deleted": false}, "h9mb1fi": {"parent_id": "p7u0n9", "awards": 3, "points": 7723, "body": "Monica Bellucci", "deleted": false}, "h9makg0": {"parent_id": "p7u0n9", "awards": 0, "points": 7332, "body": "I always thought Catherine Zeta Jones was stunning… Probably my favourite female face when I was younger. I’m totally straight but I appreciate beauty no matter the form.", "deleted": false}, "h9n2dqf": {"parent_id": "p7u0n9", "awards": 1, "points": 4405, "body": "Charlize Theron. I’m a 100% straight woman, but *DAMN* that is one fine lady!", "deleted": false}, "h9mafhs": {"parent_id": "p7u0n9", "awards": 1, "points": 5075, "body": "Kate Beckinsale", "deleted": false}, "h9mjny6": {"parent_id": "p7u0n9", "awards": 1, "points": 5749, "body": "Ewan McGregor", "deleted": false}, "h9mzun2": {"parent_id": "p7u0n9", "awards": 1, "points": 8935, "body": "Paul Rudd is ageless", "deleted": false}, "h9mfb8y": {"parent_id": "p7u0n9", "awards": 1, "points": 5402, "body": "Chris Hemsworth", "deleted": false}, "h9mf1du": {"parent_id": "p7u0n9", "awards": 3, "points": 8239, "body": "Ana De Armas, surely?", "deleted": false}, "h9mjnpl": {"parent_id": "p7u0n9", "awards": 1, "points": 4548, "body": "Natalie Portman?", "deleted": false}, "h9mfer5": {"parent_id": "p7u0n9", "awards": 3, "points": 22382, "body": "Henry Cavill (Edit: Thanks for the awards!)", "deleted": false}, "h9mapln": {"parent_id": "p7u0n9", "awards": 1, "points": 9878, "body": "Idris Elba.", "deleted": false}, "h9mexxb": {"parent_id": "p7u0n9", "awards": 1, "points": 5906, "body": "Margot Robbie", "deleted": false}, "h9mae0d": {"parent_id": "p7u0n9", "awards": 8, "points": 8511, "body": "danny devito", "deleted": false}, "h9mso5t": {"parent_id": "p7wfbp", "awards": 1, "points": 4684, "body": "Who wouldn't I bang that's over 50 would be a shorter list to compile", "deleted": false}, "h9mmsek": {"parent_id": "p7vfb0", "awards": 9, "points": 1748, "body": "Reddit.", "deleted": false}, "h9nbpwd": {"parent_id": "p7qhst", "awards": 0, "points": 5416, "body": "All those crazy fans who support serial killers just because they think they're hot. Ted Bundy fanatics etc.", "deleted": false}, "h9mioj7": {"parent_id": "p7qhst", "awards": 0, "points": 3381, "body": "The Voltron Fandom.  The show itself took a nosedive after a couple good seasons, but the fanbase got wild.  Massive shipping wars that had people run off the internet and calling each other pedophiles; blackmailing the studio; harassing VAs; someone reportedly sent cupcakes with glass in them or something.", "deleted": false}, "h9n1gqb": {"parent_id": "p7qhst", "awards": 1, "points": 3004, "body": "Literally any fanbase that calls themselves stans. Those fuckers will go to war if you mention the name of their idol in the wrong octave.", "deleted": false}, "h9msl6d": {"parent_id": "p7qhst", "awards": 1, "points": 7427, "body": "[Chris Brown](https://www.nbcnews.com/think/opinion/chris-brown-told-world-who-he-was-rihanna-we-didn-ncna1272430), seconds after he almost beat Rihanna to death, they were bending over backward to rationalize the assault, mercilessly attacking anyone who spoke up about it, and haven't stopped for over a decade. *And they won*, he's still famous, successful, and a huge participant in popular culture.", "deleted": false}, "h9mwj3d": {"parent_id": "p7qhst", "awards": 0, "points": 5706, "body": "Crazy ass BTS stans threatened to kill me when I said their Korean songs are better than their English ones.", "deleted": false}, "h9m58tb": {"parent_id": "p7qhst", "awards": 0, "points": 3664, "body": "I’m surprised that nobody has mentioned Rick and Morty yet. \n\nI believe it USED to be a toxic fandom, but when the lightning in a bottle died out it seems that only the people who are super interested in the show are still watching it. It’s still a great show nonetheless", "deleted": false}, "h9ln6b3": {"parent_id": "p7qhst", "awards": 0, "points": 5186, "body": "No one hates Star Wars more than Star Wars fans.", "deleted": false}, "h9lf6ui": {"parent_id": "p7jrfs", "awards": 4, "points": 10455, "body": "My grandfather was on the USS Indianapolis during WWII and was transferred off of it before they delivered the bombs and it sank … he happened to take a book from the ship’s library and never returned it. I inherited all of his books and happened to stumble across it while going through them… it’s stamped with the ship’s library stamp. So unless any other sailor took a book from the library of the USS Indianapolis before it sank and then held onto it all these years, this may be the only one in the world.", "deleted": false}, "h9lk7d6": {"parent_id": "p7jrfs", "awards": 0, "points": 4896, "body": "A human atlas bone from the site of a medieval prison. 25yrs ago my then bf was working as the lowest ranked barrow pusher on a building site. Foreman knew that ancient bones may turn up and knew he was supposed to send for the archaeologists if so. Bones turned up, foreman said fuck that, we're filling in, not getting behind schedule for some old shitty prisoner bones. BF tried to say something but would have been fired if he pushed it. He was pretty horrified but couldn't lose his job, and crept back to take a bone after the site closed. In his mind it was a way of saying we'll remember you, even if you're under concrete. We were only teenagers, so didn't really know what to do with it for the best. I have kept it in a box ever since. I know I should do something with it.", "deleted": false}, "h9llupt": {"parent_id": "p7jrfs", "awards": 2, "points": 7722, "body": "The  master recording of the Phantom of the Opera (or, part of it, anyway). My dad was the recording engineer so he had the tape from when they made an album of the show with the original cast.\n\nEdit: bonus item… a silver Tiffany’s cup and spoon that was given to me when I was born by Phyllis Diller. She also had it engraved “love, Phyllis Diller.”\n\nEdit 2: hahah clearly worded the Phyllis Diller bit oddly. My parents were friend with her, so she gave them an engraved silver Tiffany’s cup and spoon when I was born. She was in no way involved in the birth.", "deleted": false}, "h9ky90n": {"parent_id": "p7jrfs", "awards": 0, "points": 8457, "body": "A “Contra” NES cartridge autographed by Billy Dee Williams", "deleted": false}, "h9ktm38": {"parent_id": "p7jrfs", "awards": 2, "points": 22178, "body": "A key to unlock the B6 level on an elevator in the World Trade Center along with a matching Port Authority issued ID card.", "deleted": false}, "h9l3n1t": {"parent_id": "p7jrfs", "awards": 0, "points": 3778, "body": "My grandfather was one of the lead engineers on the Oxcart/Blackbird project for Lockheed. He engineered the pressure lock system for the cabin for high altitude. I'm in possession of a miniature proof-of-concept he made for the lock!", "deleted": false}, "h9kz714": {"parent_id": "p7jrfs", "awards": 0, "points": 4997, "body": "A 1st gen iPod prototype from 2001 with hand-soldered components", "deleted": false}, "h9k8fnm": {"parent_id": "p7jrfs", "awards": 0, "points": 12099, "body": "A piece of a turbine from a crashed Airbus A300.", "deleted": false}, "h9ktg35": {"parent_id": "p7jrfs", "awards": 2, "points": 23657, "body": "My dad saved the very button that the King of Sweden pushed to engage a new production line in the factory he worked in. The factory were shut down a few years later and dad took the opportunity to bring the button with him on his last days of work.\n\nEdit: Haha, the King didn't work in the factory. It was as an opening ceremony for the production line. The wood industry is huge in Sweden so it was a kinda big deal for the economy and so on and so on.", "deleted": false}, "h9lbdsb": {"parent_id": "p7jrfs", "awards": 2, "points": 6491, "body": "My grandfather’s diary when he was lost at sea during ww2. Records deaths and a few comments about raging hunger. 6 weeks adrift.\n\nEdit:\n\nHeres the backstory, he was serving in the merchant navy on a ship in the south Atlantic, they got torpedoed by a u boat and came under fire, his cousin took a shell to the chest, killing him instantly in front of him, they scrambled to the lifeboats and got into one.\n\nThe ship went down.\n\nAfter all the commotion the u-boat resurfaced and the german captain spoke to them, the merchants were unarmed. He explained that they were at war and attempted to give the sailors bread and potatoes, fearful that they were poisoned the food was thrown overboard.\n\nThey were adrift miles from land, unable to see the shore or any landmarks to navigate to. Over the coming weeks they collected rainwater and tried to fish as best they could but they were starving.\n\nThe entries in the diary are brief but concise, people were dying of their injuries and dehydration.\n\nAfter roughly six weeks they were spotted by another merchant ship and rescued.\n\nWhen they returned to the uk they were awarded medals but they refused them, turning their merchant navy pins upside down (MN to NW) to represent NOT WANTED.\n\nHe never spoke about this to me directly as after the war he did not want to relive the experience.\n\nHe had 2 children and 5 grandchildren and passed away in 1995.\n\nVivian (Ted) Fowler.\n\nRip.\n\nNb: other family members have requested reading it but its in such bad condition, 77 years old, that i refuse to let it out of my sight. Its kept in a plastic bag in a drawer away from harm.", "deleted": false}, "h9kg3c9": {"parent_id": "p7jrfs", "awards": 1, "points": 17022, "body": "I'm sure other people have it, but not many people have both.  I inherited a real Apollo 11 patch (that went to the moon) from my grandfather who worked on the mission and my aunt gave me a Mercury Astronaut test helmet worn by Alan Shepard.", "deleted": false}, "h9k9inb": {"parent_id": "p7jrfs", "awards": 0, "points": 3334, "body": "A piece of the wreckage from the day the music died", "deleted": false}, "h9kdlw5": {"parent_id": "p7jrfs", "awards": 2, "points": 13943, "body": "I have a tiny school book from the 1800s and the covers are filled with the writings of a little girl. \n\nI’m trying to track down her descendants to give them this book, because I don’t like having something so valuable and irreplaceable in my possession, but there is no other little book like it. \n\nIt is a history book and many of the entries would now be considered racist, especially toward Native Americans, and also this little girl, and likely her children and grandchildren, are long gone.", "deleted": false}, "h9kjob0": {"parent_id": "p7jrfs", "awards": 1, "points": 5246, "body": "I have an extended car warranty.", "deleted": false}, "h9k9xyd": {"parent_id": "p7jrfs", "awards": 2, "points": 14139, "body": "Mint condition Nirvana ticket for a concert they never played due to Kurt Cobain's death. (April 94, Manchester G-Mex).", "deleted": false}, "h9k8gp5": {"parent_id": "p7jrfs", "awards": 1, "points": 3367, "body": "A near-mint 78 RPM pressing of \"Go To The Mardi Gras\" by Professor Longhair.", "deleted": false}, "h9kg5uk": {"parent_id": "p7jrfs", "awards": 1, "points": 5708, "body": "Worlds longest spinning fidget spinner.\n\nMy father works for a ball bearing company. They developed the worlds longest spinning fidget spinner for the Guinness Book of World Records as a PR piece. He got to keep the spinner after the trials and it now sits at my desk at home.\n\nUpdate: I meant longest in terms of time spun not length. I added a video in the comment thread for those interested!\n\nUpdate 2: I’ll add the video here as well. \n\nhttps://youtu.be/A79gFQ0dCis\n\nUpdate 3: I mentioned this in the other comments but to clarify: He got to keep the original prototype. From what he told me they ended up making more to be given to clients as gifts and be used to in the record breaking spin.", "deleted": false}, "h9ktdzs": {"parent_id": "p7jrfs", "awards": 0, "points": 3644, "body": "My great great Grandfathers 1923 retirement watch. A Howard, never used still in the original case.", "deleted": false}, "h9kmpr0": {"parent_id": "p7jrfs", "awards": 0, "points": 5595, "body": "My two fully functioning kidneys are both on my left side\n\nEdit to answer questions bc I'm tired of typing on my phone!\n\nMy mom took me to the Dr when I was 2/3/4- not sure exactly. Early 80s so technology wasn't the greatest. I think they did an ultrasound and kept bringing in doctors and nurses to look at it. Of course they didn't tell my mom anything right away.\n\nI had had a lot of bladder infections and they were trying to. Figure out why. I think they said my kidneys are also small but they are both there.\n\nI got to see an x-ray about 10 years ago bc a Dr had never seen or heard of it\n\nWho would have guessed this would be my highest comment?", "deleted": false}, "h9kt73y": {"parent_id": "p7jrfs", "awards": 0, "points": 3083, "body": "A cassette tape of Les Claypool playing all of \"Animals\" by Pink Floyd on a acoustic guitar in some basement in Santa Cruz, California from some point in the 1990's.", "deleted": false}, "h9kbtvl": {"parent_id": "p7jrfs", "awards": 0, "points": 7238, "body": "14 copies of Nintendo land on the Wii U\n\nSauce: https://imgur.com/gallery/PLmo8Vu", "deleted": false}, "h9kdbco": {"parent_id": "p7jrfs", "awards": 2, "points": 14768, "body": "800-day streak in Duolingo\n\n&#x200B;\n\nEdit:\n\nThe streak is actually 794, I suppose you will pardon the round up.\n\nI know about streak freezes, but I haven't used more than 4 or 5 of them. The ones that protect your streak for the whole weekend, I've never used those.\n\n**Language:** I went through Japanese, German and Italian, and I've been focusing only on Italian for the last year and a half. I'm a spanish speaker.\n\n**Did I learn?:** Well, as much as you could expect from 5 minutes a day. I guess by now I have a decent tourist level and could more or less handle myself around Italy, but I'm VERY far from mantaining a casual conversation.\n\nCongratulations for all your streaks, higher than mine and otherwise! Keep up learning! *(you know what happens if you don't)*", "deleted": false}, "h9kavin": {"parent_id": "p7jrfs", "awards": 0, "points": 19393, "body": "I have a dimple in my thigh from when my mother had an amniocentesis when she was pregnant with me and they hit me with the needle. It's a scar from before birth.\n\nEdit: my highest rated comment and turns out it's not uncommon at all. Mission failed successfully.", "deleted": false}, "h9kdrvz": {"parent_id": "p7jrfs", "awards": 0, "points": 3514, "body": "A necklace of my own teeth", "deleted": false}, "h9k5hi2": {"parent_id": "p7jrfs", "awards": 0, "points": 4166, "body": "A birthmark on my chest the exact size and placement of a pair of dog tags. I did serve too.", "deleted": false}, "h9k4mnk": {"parent_id": "p7jrfs", "awards": 2, "points": 4839, "body": "Nice try FBI", "deleted": false}, "h9l9yg4": {"parent_id": "p7jrfs", "awards": 1, "points": 5493, "body": "B-(A) blood type. A is for anomalous. I can’t give or receive. Born with hemophilia but developed platelets around age 3. My blood has been used to develop treatments and pharmaceuticals.", "deleted": false}, "h9k7678": {"parent_id": "p7jrfs", "awards": 0, "points": 7021, "body": "My dumb ass cat.\n\nHe just fell of out the drawer he was napping in, meowed at me, and sheepishly left the room.", "deleted": false}}